&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
    // Проверка уникальности кафедры
    ПроверитьУникальностьКафедры(Отказ, Объект.Наименование, Объект.Ссылка);

КонецПроцедуры
 &НаСервере
Процедура ПроверитьУникальностьКафедры(Отказ, Наименование, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Кафедры.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.Кафедры КАК Кафедры
    |ГДЕ
    |   Кафедры.Наименование = &Наименование
    |   И Кафедры.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();

     РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой элемент уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;


КонецПроцедуры    

