
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ГрафикПересдач
	Движения.ГрафикПересдач.Записывать = Истина;
	Для Каждого ТекСтрокаРасписаниеПересдач Из РасписаниеПересдач Цикл
		Движение = Движения.ГрафикПересдач.Добавить();
		Движение.Преподаватель = ТекСтрокаРасписаниеПересдач.Преподаватель;
		Движение.Аудитория = ТекСтрокаРасписаниеПересдач.Аудитория;
		Движение.Дисциплина = ТекСтрокаРасписаниеПересдач.Дисциплина;
		Движение.ДатаВыдачи = ДатаСоставления;
		Движение.ДатаПересдачи = ТекСтрокаРасписаниеПересдач.ДатаИВремя;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей") Тогда
		// Заполнение шапки
		Семестр = ДанныеЗаполнения.Семестр;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		УчебныйГод = ДанныеЗаполнения.УчебныйГод;
		Факультет = ДанныеЗаполнения.Факультет;    
		Дисциплина = ДанныеЗаполнения.Дисциплина;
		ПреподавательКомиссии = ДанныеЗаполнения.ПреподавательКомиссии;
		Для Каждого ТекСтрокаНазначениеСтудентаДляПреподавателя Из ДанныеЗаполнения.НазначениеСтудентаДляПреподавателя Цикл
			НоваяСтрока = РасписаниеПересдач.Добавить();
			НоваяСтрока.Студент = ТекСтрокаНазначениеСтудентаДляПреподавателя.Студент;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
