
&НаКлиенте
Процедура ХарактеристикаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
 // Запрещаем ручное добавление строк в табличную часть
    Отказ = Истина;
    ПоказатьПредупреждение(, "Добавление строк вручную запрещено! Строки заполняются автоматически из документа-основания!");
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПередУдалением(Элемент, Отказ)
	 // Запрещаем удаление строк из табличной части
    Отказ = Истина;
    ПоказатьПредупреждение(, "Удаление строк запрещено! Для изменения состава задолженностей измените документ 'Академическая неуспеваемость' на основании актуальных данных!");
КонецПроцедуры 

