
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ТекущийСтатусЗадолженностей
	Движения.ТекущийСтатусЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ТекущийСтатусЗадолженностей.Добавить();
		Движение.Студент = ТекСтрокаДолги.Студент;
		Движение.Семестр = Семестр;
		Движение.КоличествоВозникшихЗадолженностей = ТекСтрокаДолги.КоличествоВозникшихЗадолженностей;
		Движение.КоличествоУспешныхПересдач = ТекСтрокаДолги.КоличествоУспешныхПересдач;
		Движение.СтатусЗадолженности = ТекСтрокаДолги.СтатусЗадолженности;
		Движение.ПричинаВозникновения = ТекСтрокаДолги.ПричинаВозникновения;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ГрафикЛиквидацииЗадолженностей") Тогда
		// Заполнение шапки
		Семестр = ДанныеЗаполнения.Семестр;
		Для Каждого ТекСтрокаРасписаниеПересдач Из ДанныеЗаполнения.РасписаниеПересдач Цикл
			НоваяСтрока = Долги.Добавить();
			НоваяСтрока.Студент = ТекСтрокаРасписаниеПересдач.Студент;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколЗаседанияКомиссии") Тогда
		// Заполнение шапки
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
