
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УспешныеПересдачи Приход
	Движения.УспешныеПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.УспешныеПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаДолги.Студент;
		Движение.Группа = Группа;
		Движение.Дисциплина = Дисциплина;
		Движение.КоличествоУспешныхПересдач = ТекСтрокаДолги.КоличествоУспешныхПересдач;
		Движение.СуммаБаллов = ТекСтрокаДолги.СуммаБаллов;
	КонецЦикла;

	// регистр ДинамикаЛиквидацииЗадолженностей 
	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Дисциплина = Дисциплина;
		Движение.Группа = Группа;
		Движение.КоличествоВозникшихЗадолженностей = ТекСтрокаДолги.КоличествоВозникшихЗадолженностей;
		Движение.КоличествоЛиквидированныхЗадолженностей = ТекСтрокаДолги.КоличествоУспешныхПересдач;
	КонецЦикла;

	// регистр ТекущийСтатусЗадолженностей
	Движения.ТекущийСтатусЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ТекущийСтатусЗадолженностей.Добавить();
		Движение.Студент = ТекСтрокаДолги.Студент;
		Движение.Дисциплина = Дисциплина;
		Движение.Семестр = Семестр;
		Движение.КоличествоВозникшихЗадолженностей = ТекСтрокаДолги.КоличествоВозникшихЗадолженностей;
		Движение.КоличествоУспешныхПересдач = ТекСтрокаДолги.КоличествоУспешныхПересдач;
		Движение.СтатусЗадолженности = ТекСтрокаДолги.СтатусЗадолженности;
		Движение.ПричинаВозникновения = ТекСтрокаДолги.ПричинаВозникновения;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ГрафикЛиквидацииЗадолженностей") Тогда
		// Заполнение шапки
		Семестр = ДанныеЗаполнения.Семестр;
		Для Каждого ТекСтрокаРасписаниеПересдач Из ДанныеЗаполнения.РасписаниеПересдач Цикл
			НоваяСтрока = Долги.Добавить();
			НоваяСтрока.Студент = ТекСтрокаРасписаниеПересдач.Студент;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
