
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОплатаЗаПересдачи Приход
	Движения.ОплатаЗаПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.ОплатаЗаПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.ФормаКонтроля = ТекСтрокаПлан.ФормаКонтроля;
		Движение.СуммаОплаты = ТекСтрокаПлан.СуммаОплаты;
		Движение.КоличествоОплаченныхПересдач = ТекСтрокаПлан.Причина;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
