
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВедомостьОСистемеАкадемическихЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Дата,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Номер,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Преподаватель,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.РезультатЗаседанияКомиссии.(
	|		НомерСтроки,
	|		Группа,
	|		Студент,
	|		ВидКонтроля,
	|		Дисциплина,
	|		Оценка,
	|		СтатусАкадемическойЗадолженности
	|	)
	|ИЗ
	|	Документ.ВедомостьОСистемеАкадемическихЗадолженностей КАК ВедомостьОСистемеАкадемическихЗадолженностей
	|ГДЕ
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРезультатЗаседанияКомиссииШапка = Макет.ПолучитьОбласть("РезультатЗаседанияКомиссииШапка");
	ОбластьРезультатЗаседанияКомиссии = Макет.ПолучитьОбласть("РезультатЗаседанияКомиссии");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРезультатЗаседанияКомиссииШапка);
		ВыборкаРезультатЗаседанияКомиссии = Выборка.РезультатЗаседанияКомиссии.Выбрать();
		Пока ВыборкаРезультатЗаседанияКомиссии.Следующий() Цикл
			ОбластьРезультатЗаседанияКомиссии.Параметры.Заполнить(ВыборкаРезультатЗаседанияКомиссии);
			ТабДок.Вывести(ОбластьРезультатЗаседанияКомиссии, ВыборкаРезультатЗаседанияКомиссии.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
