
#Область ТекущаяИнформация

// Процедура для самозаполнения данных
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	// ФИО автора
	элементы.ФИО.Заголовок =  "Былков Денис Андреевич"; 
	// Контакт разработчика
	элементы.Содержание.Заголовок =  "70180166@online.muiv.ru";  
	// Группа автора
	элементы.АвторскаяГруппа.Заголовок =  "ИД 23.1/Б1-21";
	// ФИО куратора
	элементы.ФИО_кур.Заголовок =  "к.т.н Блощук Андрей Алексеевич";  
	// Версия обработки
	элементы.сама_версия.Заголовок =  "0.0.5";    
	// Ссылка на GIT
	элементы.Ссылочка.Заголовок =  "Github.com";   
	// Тема ВКР
	элементы.ВКР.Заголовок =  "Разработка автоматизированной системы учета академических задолженностей студентов на платформе «1С:Предприятие» (на примере Частного образовательного учреждения высшего образования «Московский университет имени С.Ю. Витте»)";   	
	
КонецПроцедуры

// Нужна, чтобы отрабатывать гиперссылочки
&НаКлиенте
Процедура СсылочкаНажатие(Элемент)    
	
	// Запускает любой сайт по нажатию на гиперссылку
	ЗапуститьПриложение("https://github.com/DLordxxx/Practice.git");

КонецПроцедуры
 
#КонецОбласти

  
  
  
  
