
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НеявкиНаПересдачи Расход
	Движения.НеявкиНаПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаНазначениеСтудентаДляПреподавателя Из НазначениеСтудентаДляПреподавателя Цикл
		Движение = Движения.НеявкиНаПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаНазначениеСтудентаДляПреподавателя.Студент;
		Движение.Дисциплина = Дисциплина;
		Движение.Преподаватель = ПреподавательКомиссии;
		Движение.КоличествоНеявок = ТекСтрокаНазначениеСтудентаДляПреподавателя.КоличествоПропусков;
		Движение.ПотерянныеЧасыПреподавателя = ТекСтрокаНазначениеСтудентаДляПреподавателя.ПотерянныеЧасыПреподавателя;
	КонецЦикла;

	// регистр НагрузкаКомиссий 
	Движения.НагрузкаКомиссий.Записывать = Истина;
	Для Каждого ТекСтрокаНазначениеСтудентаДляПреподавателя Из НазначениеСтудентаДляПреподавателя Цикл
		Движение = Движения.НагрузкаКомиссий.Добавить();
		Движение.Период = Дата;
		Движение.Преподаватель = ПреподавательКомиссии;
		Движение.ВидЗадолженности = ТекСтрокаНазначениеСтудентаДляПреподавателя.НаименованиеВида;
		Движение.КоличествоЗаседаний = КоличествоЗаседаний;
		Движение.ЧасыРаботы = ТекСтрокаНазначениеСтудентаДляПреподавателя.ПотерянныеЧасыПреподавателя;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
