
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОплатаЗаПересдачи Приход
	Движения.ОплатаЗаПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаРасписаниеПересдач Из РасписаниеПересдач Цикл
		Движение = Движения.ОплатаЗаПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаРасписаниеПересдач.Студент;
		Движение.ФормаКонтроля = ТекСтрокаРасписаниеПересдач.ФормаКонтроля;
		Движение.СуммаОплаты = ТекСтрокаРасписаниеПересдач.СуммаОплаты;
		Движение.КоличествоОплаченныхПересдач = ТекСтрокаРасписаниеПересдач.КоличествоОплаченныхПересдач;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
