
&НаСервере
Функция НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение)
	Если Значение = Перечисления.КоличествоПропусков.Ноль Тогда
		Возврат "-";
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Один Тогда
		Возврат 2;
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Два Тогда
		Возврат 4;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзменении(Элемент)  
	ТЧ = Элементы.НазначениеСтудентаДляПреподавателя.ТекущиеДанные;
	Значение = ТЧ.КоличествоПропусков;
	ТЧ.ПотерянныеЧасыПреподавателя = НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение);
КонецПроцедуры
