&НаКлиенте
Процедура ЕстьДопополнительнаяИнформацияПриИзменении(Элемент)
	Если Объект.ЕстьДополнительнаяИнформация = Истина Тогда
		Элементы.ДополнительнаяИнформация.Видимость = Истина;
		
	Иначе
		Элементы.ДополнительнаяИнформация.Видимость = Ложь;
		Объект.ДополнительнаяИнформация = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.IDСотрудника) Тогда
        Сообщить("Необходимо заполнить личный индекс студента.");
        Отказ = Истина;
        Возврат;
	КонецЕсли;
	
	 Если Объект.ЕстьДополнительнаяИнформация 
        И Не ЗначениеЗаполнено(Объект.ДополнительнаяИнформация) Тогда
        Отказ = Истина;
        Сообщить("Не заполнена дополнительная информация при установленном флаге!");
    КонецЕсли;

    ПроверитьУникальностьИндекса(Отказ, Объект.IDСотрудника, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьИндекса(Отказ, ЛичныйИндекс, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
         | Сотрудники.Ссылка
    |ИЗ
         | Справочник.Сотрудники КАК Сотрудники
    |ГДЕ
         | Сотрудники.IDСотрудника = &IDСотрудника
         | И Сотрудники.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("IDСотрудника", ЛичныйИндекс);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой личный индекс уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры