
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.РекомендацииПоСтудентам.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РекомендацииПоСтудентам.Группа,
	|	РекомендацииПоСтудентам.Дата,
	|	РекомендацииПоСтудентам.Номер,
	|	РекомендацииПоСтудентам.Рекомендация,
	|	РекомендацииПоСтудентам.Студент,
	|	РекомендацииПоСтудентам.ФормаОбучения
	|ИЗ
	|	Документ.РекомендацииПоСтудентам КАК РекомендацииПоСтудентам
	|ГДЕ
	|	РекомендацииПоСтудентам.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
