
&НаКлиенте
Процедура Открыть_динамику(Команда)
	
		// Проверяем права на сервере, где доступна функция РольДоступна
    	Если Не ПроверитьПраваНаСервере() Тогда
        	ПоказатьПредупреждение(,"Недостаточно прав для просмотра!");
        	Возврат;
    	КонецЕсли;

	    Форма = ПолучитьФорму("Обработка.БизнесАналитика.Форма.ФункционалПервый");
	    // Делаем открытие данной формы
	    Форма.Открыть();	
	
	
КонецПроцедуры


&НаКлиенте
Процедура Открыть_тестирование(Команда)

		Форма = ПолучитьФорму("Обработка.БизнесАналитика.Форма.ФункционалВторой");
	    // Делаем открытие данной формы
	    Форма.Открыть();		
	
КонецПроцедуры


&НаКлиенте
Процедура О_себе(Команда)
	
		Форма = ПолучитьФорму("Обработка.БизнесАналитика.Форма.СправочнаяИнформация");
	    // Делаем открытие данной формы
	    Форма.Открыть();

КонецПроцедуры  
	
&НаСервере
Функция ПроверитьПраваНаСервере()
    
    // Разрешаем функционал для роли "Декан"
    Если РольДоступна("Декан") Тогда
        Возврат Истина;
    КонецЕсли;
	
	Возврат Ложь; // Для других ролей возвращаем "Ложь"
КонецФункции
	
	

