
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДинамикаЛиквидацииЗадолженностей 
	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.КоличествоВозникшихЗадолженностей = КоличествоВозникшихЗадолженностей;
		Движение.КоличествоЛиквидированныхЗадолженностей = КоличествоЛиквидированныхЗадолженностей;
	КонецЦикла;

	// регистр ДинамикаЛиквидацииЗадолженностей 
	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.КоличествоВозникшихЗадолженностей = КоличествоВозникшихЗадолженностей;
		Движение.КоличествоЛиквидированныхЗадолженностей = КоличествоЛиквидированныхЗадолженностей;
	КонецЦикла;

	// регистр УспешныеПересдачи 
	Движения.УспешныеПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.УспешныеПересдачи.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Дисциплина = ТекСтрокаДолги.Дисциплина;
		Движение.КоличествоУспешныхПересдач = КоличествоЛиквидированныхЗадолженностей;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РекомендацииПоСтудентам") Тогда
		// Заполнение шапки
		Группа = ДанныеЗаполнения.Группа;
		Студент = ДанныеЗаполнения.Студент;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
