
&НаКлиенте
Процедура Диаграмма_круговая(Команда)
	
	
	    Форма = ПолучитьФорму("Обработка.Академ_задолженность.Форма.ДиаграммаКруговая");
	    // Делаем открытие данной формы
	    Форма.Открыть();	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Отчёт_по_академическим_задолжностям(Команда)
	
	
	    Форма = ПолучитьФорму("Отчет.АнализЗадолженностей.Форма");
	    // Делаем открытие данной формы
	    Форма.Открыть();	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Возвратная(Команда)
	
	    Форма = ПолучитьФорму("Обработка.Академ_задолженность.Форма.Главная");
	    // Делаем открытие данной формы
	    Форма.Открыть();	
	
	
КонецПроцедуры
