
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УспешныеПересдачи Приход
	Движения.УспешныеПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаСтатистика Из Статистика Цикл
		Движение = Движения.УспешныеПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаСтатистика.Студент;
		Движение.Группа = ТекСтрокаСтатистика.Группа;
		Движение.Дисциплина = Дисциплина;
		Движение.КоличествоУспешныхПересдач = ТекСтрокаСтатистика.КоличествоУспешныхПересдач;
		Движение.СуммаБаллов = ТекСтрокаСтатистика.СуммаБаллов;
	КонецЦикла;

	// регистр ДинамикаЛиквидацииЗадолженностей 
	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаСтатистика Из Статистика Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Дисциплина = Дисциплина;
		Движение.Группа = ТекСтрокаСтатистика.Группа;
		Движение.КоличествоВозникшихЗадолженностей = ТекСтрокаСтатистика.КоличествоЗадолженностей;
		Движение.КоличествоЛиквидированныхЗадолженностей = ТекСтрокаСтатистика.КоличествоУспешныхПересдач;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
