
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности") Тогда
		// Заполнение шапки
		Группа = ДанныеЗаполнения.Группа;
		Дисциплина = ДанныеЗаполнения.Дисциплина;
		ДатаПересдачи = ДанныеЗаполнения.ЗапрашиваемыйСрок;
		НаименованиеКонтроля = ДанныеЗаполнения.НаименованиеКонтроля;
		Причина = ДанныеЗаполнения.Ссылка;
		Студент = ДанныеЗаполнения.Студент;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДатыПересдач
	Движения.ДатыПересдач.Записывать = Истина;
	Движение = Движения.ДатыПересдач.Добавить();
	Движение.Преподаватель = Преподаватель;
	Движение.Аудитория = Аудитория;
	Движение.Дисциплина = Дисциплина;
	Движение.ДатаВыдачи = ДатаПересдачи;
	Движение.ДатаПересдачи = ДатаПересдачи;
	Движение.ВремяПересдачи = Время;

КонецПроцедуры
