
&НаКлиенте
Процедура Диаграмма_круговая(Команда)
        
    // Открываем форму только если проверка пройдена
    Форма = ПолучитьФорму("Обработка.БизнесАналитика.Форма.ДиаграммаКруговая");
    Форма.Открыть();
    
КонецПроцедуры


&НаКлиенте
Процедура Отчет_по_академическим_задолжностям(Команда)
	
	
	    Форма = ПолучитьФорму("Отчет.АнализАкадемическойНеуспеваемости.Форма");
	    // Делаем открытие данной формы
	    Форма.Открыть();	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Возвратная(Команда)
	
	    Форма = ПолучитьФорму("Обработка.БизнесАналитика.Форма.Главная");
	    // Делаем открытие данной формы
	    Форма.Открыть();	
	
	
КонецПроцедуры
