

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	  ФакультетОснование = Объект.ДокументОснование.Факультет;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.НазначениеСтудентаДляПреподавателя.(
		|		Студент КАК Студент
		|	) КАК НазначениеСтудентаДляПреподавателя,
		|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Дисциплина КАК Дисциплина,
		|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.ПреподавательКомиссии КАК Преподаватель
		|ИЗ
		|	Документ.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей КАК ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей
		|ГДЕ
		|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Факультет = &ФакультетОснование";
	
	Запрос.УстановитьПараметр("ФакультетОснование", ФакультетОснование);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТаблицаСтудентов = РезультатЗапроса.Выгрузить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
			
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	НоваяСтр = Объект.РасписаниеПересдач.Добавить();
	//	//НоваяСтр.Студент = ВыборкаДетальныеЗаписи.Студент;  
	//	НоваяСтр.Дисциплина = ВыборкаДетальныеЗаписи.Дисциплина;
	//	НоваяСтр.Преподаватель = ВыборкаДетальныеЗаписи.Преподаватель;   
		
	//КонецЦикла;
КонецПроцедуры

