
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ИдентификацияАкадемическихЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификацияАкадемическихЗадолженностей.Группа,
	|	ИдентификацияАкадемическихЗадолженностей.Дата,
	|	ИдентификацияАкадемическихЗадолженностей.ЛичныйИндекс,
	|	ИдентификацияАкадемическихЗадолженностей.НаправленияПодготовки,
	|	ИдентификацияАкадемическихЗадолженностей.Номер,
	|	ИдентификацияАкадемическихЗадолженностей.Семестр,
	|	ИдентификацияАкадемическихЗадолженностей.Студент,
	|	ИдентификацияАкадемическихЗадолженностей.Факультет,
	|	ИдентификацияАкадемическихЗадолженностей.ФормаОбучения,
	|	ИдентификацияАкадемическихЗадолженностей.Характеристика.(
	|		НомерСтроки,
	|		Дисциплины,
	|		НаименованияКонтроляСтудентов
	|	)
	|ИЗ
	|	Документ.ИдентификацияАкадемическихЗадолженностей КАК ИдентификацияАкадемическихЗадолженностей
	|ГДЕ
	|	ИдентификацияАкадемическихЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьХарактеристикаШапка = Макет.ПолучитьОбласть("ХарактеристикаШапка");
	ОбластьХарактеристика = Макет.ПолучитьОбласть("Характеристика");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьХарактеристикаШапка);
		ВыборкаХарактеристика = Выборка.Характеристика.Выбрать();
		Пока ВыборкаХарактеристика.Следующий() Цикл
			ОбластьХарактеристика.Параметры.Заполнить(ВыборкаХарактеристика);
			ТабДок.Вывести(ОбластьХарактеристика, ВыборкаХарактеристика.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
