
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.РезультатыПредыдущихСессий.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РезультатыПредыдущихСессий.Дата,
	|	РезультатыПредыдущихСессий.Номер,
	|	РезультатыПредыдущихСессий.Студент,
	|	РезультатыПредыдущихСессий.Факультет,
	|	РезультатыПредыдущихСессий.ХарактеристикаСтудента.(
	|		НомерСтроки,
	|		Дисциплина,
	|		Оценка
	|	)
	|ИЗ
	|	Документ.РезультатыПредыдущихСессий КАК РезультатыПредыдущихСессий
	|ГДЕ
	|	РезультатыПредыдущихСессий.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьХарактеристикаСтудентаШапка = Макет.ПолучитьОбласть("ХарактеристикаСтудентаШапка");
	ОбластьХарактеристикаСтудента = Макет.ПолучитьОбласть("ХарактеристикаСтудента");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьХарактеристикаСтудентаШапка);
		ВыборкаХарактеристикаСтудента = Выборка.ХарактеристикаСтудента.Выбрать();
		Пока ВыборкаХарактеристикаСтудента.Следующий() Цикл
			ОбластьХарактеристикаСтудента.Параметры.Заполнить(ВыборкаХарактеристикаСтудента);
			ТабДок.Вывести(ОбластьХарактеристикаСтудента, ВыборкаХарактеристикаСтудента.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
