
&НаКлиенте
Процедура Открыть_динамику(Команда)
	
	    Форма = ПолучитьФорму("Обработка.Академ_задолженность.Форма.Функционал_первый");
	    // Делаем открытие данной формы
	    Форма.Открыть();	
	
	
КонецПроцедуры


&НаКлиенте
Процедура Открыть_тестирование(Команда)

		Форма = ПолучитьФорму("Обработка.Академ_задолженность.Форма.Выбор_тестирования");
	    // Делаем открытие данной формы
	    Форма.Открыть();		
	
КонецПроцедуры


&НаКлиенте
Процедура О_себе(Команда)

		Форма = ПолучитьФорму("Обработка.Академ_задолженность.Форма.Справочная_информация");
	    // Делаем открытие данной формы
	    Форма.Открыть();

КонецПроцедуры

