
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетСтипендииСУчетомЗадолженностей
	Движения.РасчетСтипендииСУчетомЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаРезультатЗаседанияКомиссии Из РезультатЗаседанияКомиссии Цикл
		Движение = Движения.РасчетСтипендииСУчетомЗадолженностей.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = ДатаЗаседания;
		Движение.Студент = Студент;
		Движение.БазоваяСтипендия = ТекСтрокаРезультатЗаседанияКомиссии.БазоваяСтипендия;
		Движение.КоэффициентСнижения = ТекСтрокаРезультатЗаседанияКомиссии.КоэффициентСнижения;
		Движение.ПричинаИзменения = ТекСтрокаРезультатЗаседанияКомиссии.ПричинаИзменения;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
