
&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Студент) Тогда
        ЛичныйИндексСтудента = ПолучитьЛичныйИндексСтудентаНаСервере(Объект.Студент);
        Объект.Наименование = ЛичныйИндексСтудента; 
		
		Если ЗначениеЗаполнено(ЛичныйИндексСтудента) Тогда
            Объект.Наименование = ЛичныйИндексСтудента;
        КонецЕсли;
		КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЛичныйИндексСтудентаНаСервере(СсылкаНаСтудента)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Студенты.ЛичныйИндекс КАК ЛичныйИндекс
    |ИЗ
    |	Справочник.Студенты КАК Студенты
    |ГДЕ
    |	Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.ЛичныйИндекс;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьУникальностьСтудента(Отказ, Объект.Наименование, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьСтудента(Отказ, Наименование, Ссылка)

    Если Не ЗначениеЗаполнено(Наименование) Тогда
        Возврат;
    КонецЕсли;
    
    Отказ = Ложь;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
	"ВЫБРАТЬ
    |   ЛичныеИндексыСтудентов.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.ЛичныеИндексыСтудентов КАК ЛичныеИндексыСтудентов
    |ГДЕ
    |   ЛичныеИндексыСтудентов.Наименование = &Наименование
    |   И ЛичныеИндексыСтудентов.Ссылка <> &Ссылка";  
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    	
	РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Выбранный студент уже записан!");
        Отказ = Истина;
    КонецЕсли;

    
КонецПроцедуры


