&НаКлиенте
Процедура ФИОСтудентаПриИзменении(Элемент)
	  Если ЗначениеЗаполнено(Объект.ФИОСтудента) Тогда
        СтудБилетСтудента = ПолучитьСтудБилетСтудентаНаСервере(Объект.ФИОСтудента);
        Объект.Наименование = СтудБилетСтудента;
    Иначе
        Объект.Наименование = Неопределено;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтудБилетСтудентаНаСервере(СсылкаНаСтудента)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Студенты.СтуденческийБилет КАК СтуденческийБилет
    |ИЗ
    |	Справочник.Студенты КАК Студенты
    |ГДЕ
    |	Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.СтуденческийБилет;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьУникальностьСтудБилет(Отказ, Объект.Наименование, Объект.Ссылка);
КонецПроцедуры  

&НаСервере
Процедура ПроверитьУникальностьСтудБилет(Отказ, Наименование, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   СтуденческиеБилеты.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.СтуденческиеБилеты КАК СтуденческиеБилеты
    |ГДЕ
    |   СтуденческиеБилеты.Наименование = &Наименование
    |   И СтуденческиеБилеты.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();


    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой студент уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры



