&НаКлиенте
Процедура ФИОСтудентаПриИзменении(Элемент)
	  Если ЗначениеЗаполнено(Объект.ФИОСтудента) Тогда
        СтудБилетСтудента = ПолучитьСтудБилетСтудентаНаСервере(Объект.ФИОСтудента);
        Объект.Наименование = СтудБилетСтудента;
    Иначе
        Объект.Наименование = Неопределено;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтудБилетСтудентаНаСервере(СсылкаНаСтудента)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Студенты.СтуденческийБилет КАК СтуденческийБилет
    |ИЗ
    |	Справочник.Студенты КАК Студенты
    |ГДЕ
    |	Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.СтуденческийБилет;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции