&НаКлиенте
Процедура СеместрПриИзменении(Элемент)   
	Значение = Объект.Семестр;
   	Объект.Курс = СеместрПриИзмененииНаСервере (Значение);
   КонецПроцедуры 

&НаСервере
Функция СеместрПриИзмененииНаСервере(Значение) 
    Если Значение = Перечисления.Семестры.Первый ИЛИ Значение = Перечисления.Семестры.Второй Тогда  
        Возврат Перечисления.Курсы.Первый; 
    ИначеЕсли Значение = Перечисления.Семестры.Третий ИЛИ Значение = Перечисления.Семестры.Четвертый Тогда  
        Возврат Перечисления.Курсы.Второй; 
    ИначеЕсли Значение = Перечисления.Семестры.Пятый ИЛИ Значение = Перечисления.Семестры.Шестой Тогда  
        Возврат Перечисления.Курсы.Третий; ;
    ИначеЕсли Значение = Перечисления.Семестры.Седьмой ИЛИ Значение = Перечисления.Семестры.Восьмой Тогда  
        Возврат Перечисления.Курсы.Четвертый; 
	ИначеЕсли Значение = Перечисления.Семестры.Девятый ИЛИ Значение = Перечисления.Семестры.Десятый Тогда  
        Возврат Перечисления.Курсы.Пятый;
	ИначеЕсли Значение = Перечисления.Семестры.Одиннадцатый ИЛИ Значение = Перечисления.Семестры.Двенадцатый Тогда  
        Возврат Перечисления.Курсы.Шестой; 
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    ПроверитьУникальностьИндекса(Отказ, Объект.ЛичныйИндекс, Объект.Ссылка);
	ПроверитьУникальностьСтудБилета(Отказ, Объект.СтуденческийБилет, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьИндекса(Отказ, ЛичныйИндекс, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
         | Студенты.Ссылка
    |ИЗ
         | Справочник.Студенты КАК Студенты
    |ГДЕ
         | Студенты.ЛичныйИндекс = &ЛичныйИндекс
         | И Студенты.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("ЛичныйИндекс", ЛичныйИндекс);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой личный индекс уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры    

&НаСервере
Процедура ПроверитьУникальностьСтудБилета(Отказ, СтуденческийБилет, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
         | Студенты.Ссылка
    |ИЗ
         | Справочник.Студенты КАК Студенты
    |ГДЕ
         | Студенты.СтуденческийБилет = &СтуденческийБилет
         | И Студенты.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("СтуденческийБилет", СтуденческийБилет);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой студенческий билет уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры