&НаКлиенте
Процедура СеместрПриИзменении(Элемент)   
	Значение = Объект.Семестр;
   	Объект.Курс = СеместрПриИзмененииНаСервере (Значение);
   КонецПроцедуры 

&НаСервере
Функция СеместрПриИзмененииНаСервере(Значение) 
    Если Значение = Перечисления.Семестры.Первый ИЛИ Значение = Перечисления.Семестры.Второй Тогда  
        Возврат "1"; 
    ИначеЕсли Значение = Перечисления.Семестры.Третий ИЛИ Значение = Перечисления.Семестры.Четвертый Тогда  
        Возврат "2";
    ИначеЕсли Значение = Перечисления.Семестры.Пятый ИЛИ Значение = Перечисления.Семестры.Шестой Тогда  
        Возврат "3";
    ИначеЕсли Значение = Перечисления.Семестры.Седьмой ИЛИ Значение = Перечисления.Семестры.Восьмой Тогда  
        Возврат "4";
    ИначеЕсли Значение = Перечисления.Семестры.Девятый ИЛИ Значение = Перечисления.Семестры.Десятый Тогда  
        Возврат "5";
    КонецЕсли;	
    Возврат Неопределено; 
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    ПроверитьУникальностьИндекса(Отказ, Объект.ЛичныйИндекс, Объект.Ссылка);
	ПроверитьУникальностьСтудБилета(Отказ, Объект.СтуденческийБилет, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьИндекса(Отказ, ЛичныйИндекс, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
         | Студенты.Ссылка
    |ИЗ
         | Справочник.Студенты КАК Студенты
    |ГДЕ
         | Студенты.ЛичныйИндекс = &ЛичныйИндекс
         | И Студенты.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("ЛичныйИндекс", ЛичныйИндекс);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой личный индекс уже существует!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры    

&НаСервере
Процедура ПроверитьУникальностьСтудБилета(Отказ, СтуденческийБилет, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
         | Студенты.Ссылка
    |ИЗ
         | Справочник.Студенты КАК Студенты
    |ГДЕ
         | Студенты.СтуденческийБилет = &СтуденческийБилет
         | И Студенты.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("СтуденческийБилет", СтуденческийБилет);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой личный индекс уже существует!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры