&НаСервере
Процедура ЗаполнитьКафедрыФакультетаНаСервере()

    // Очищаем табличную часть перед заполнением
    Объект.Содержание.Очистить();

    // Если факультет новый или не имеет наименования - выходим
    Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
        Возврат;
    КонецЕсли;

    // Создаем запрос для выборки кафедр
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Кафедры.Ссылка КАК Кафедра,
    |   Кафедры.Наименование КАК НаименованиеКафедры
    |ИЗ
    |   Справочник.Кафедры КАК Кафедры
    |ГДЕ
    |   Кафедры.ЭтоГруппа = Ложь
    |   И Кафедры.Родитель.Наименование = &НаименованиеФакультета";

    // Устанавливаем параметр запроса
    Запрос.УстановитьПараметр("НаименованиеФакультета", Объект.Наименование);

    // Выполняем запрос
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    // Заполняем табличную часть "Содержание"
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.Содержание.Добавить();
        НоваяСтрока.Кафедра = Выборка.Кафедра;
    КонецЦикла;

КонецПроцедуры     

&НаКлиенте
Процедура ЗаполнитьКафедры()
    // Вызываем серверный метод для заполнения кафедр
    ЗаполнитьКафедрыФакультетаНаСервере();
КонецПроцедуры      


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
    // Если наименование изменилось - обновляем список кафедр
    Если ЗначениеЗаполнено(Объект.Наименование) Тогда
        ЗаполнитьКафедры();
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
    // Проверка уникальности факультета
    ПроверитьУникальностьФакультета(Отказ, Объект.Наименование, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьФакультета(Отказ, Наименование, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Факультеты.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.Факультеты КАК Факультеты
    |ГДЕ
    |   Факультеты.Наименование = &Наименование
    |   И Факультеты.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();

     РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой факультет уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;


КонецПроцедуры
