&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
    // Проверка уникальности кафедры
    ПроверитьУникальностьНаправленияПодготовки(Отказ, Объект.Наименование, Объект.Ссылка);

КонецПроцедуры
 &НаСервере
Процедура ПроверитьУникальностьНаправленияПодготовки(Отказ, Наименование, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   НаправлениеПодготовки.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.НаправлениеПодготовки КАК НаправлениеПодготовки
    |ГДЕ
    |   НаправлениеПодготовки.Наименование = &Наименование
    |   И НаправлениеПодготовки.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();

     РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такое направление подготовки уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;


КонецПроцедуры    

