&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)

	// Проверка заполненности индекса
    Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИндексСтудента) Тогда
        ВызватьИсключение "Не указан личный индекс студента!";
    КонецЕсли;
    
    // Проверка существования студента
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Студенты.Ссылка
    |ИЗ
    |    Справочник.Студенты КАК Студенты
    |ГДЕ
    |    Студенты.ЛичныйИндекс = &ЛичныйИндекс
    |    И НЕ Студенты.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("ЛичныйИндекс", ЭтотОбъект.ИндексСтудента);
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        НеверныйИндекс = ЭтотОбъект.ИндексСтудента;
		Отказ = Истина;

		ВызватьИсключение "Студент с индексом '" + НеверныйИндекс + "' не найден! Поле было очищено.";
		Возврат;

	КонецЕсли; 
	
	// регистр КонтрольАкадемическойНеуспеваемости 
	Движения.КонтрольАкадемическойНеуспеваемости.Записывать = Истина;
	Для Каждого ТекСтрокаХарактеристикаСтудента Из ХарактеристикаСтудента Цикл
		Движение = Движения.КонтрольАкадемическойНеуспеваемости.Добавить();
		Движение.Период = Дата;
		Движение.ИндексСтудента = ИндексСтудента;
		Движение.Дисциплина = ТекСтрокаХарактеристикаСтудента.Дисциплина;
		Движение.ПричинаВозникновения = ТекСтрокаХарактеристикаСтудента.ПричинаВозникновенияЗадолженности;
		Движение.Семестр = ТекСтрокаХарактеристикаСтудента.Семестр;
		Движение.КоличествоПересдачПоДисциплинам = ТекСтрокаХарактеристикаСтудента.НомерСтроки;
	КонецЦикла;

КонецПроцедуры