
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПротоколЗаседанияКомиссии.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПротоколЗаседанияКомиссии.Группа,
	|	ПротоколЗаседанияКомиссии.Дата,
	|	ПротоколЗаседанияКомиссии.КоличествоВозникшихЗадолженностей,
	|	ПротоколЗаседанияКомиссии.КоличествоЛиквидированныхЗадолженностей,
	|	ПротоколЗаседанияКомиссии.Номер,
	|	ПротоколЗаседанияКомиссии.Семестр,
	|	ПротоколЗаседанияКомиссии.Студент
	|ИЗ
	|	Документ.ПротоколЗаседанияКомиссии КАК ПротоколЗаседанияКомиссии
	|ГДЕ
	|	ПротоколЗаседанияКомиссии.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
