
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.КоличествоВозникшихЗадолженностей = КоличествоВозникшихЗадолженностей;
		Движение.КоличествоЛиквидированныхЗадолженностей = КоличествоЛиквидированныхЗадолженностей;
	КонецЦикла;

	
	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.КоличествоВозникшихЗадолженностей = КоличествоВозникшихЗадолженностей;
		Движение.КоличествоЛиквидированныхЗадолженностей = КоличествоЛиквидированныхЗадолженностей;
	КонецЦикла;
	
	
	Движения.УспешныеПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.УспешныеПересдачи.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Дисциплина = ТекСтрокаДолги.Дисциплина;
		Движение.КоличествоУспешныхПересдач = КоличествоЛиквидированныхЗадолженностей;
	КонецЦикла;

	КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РекомендацииПоСтудентам") Тогда
		
		Группа = ДанныеЗаполнения.Группа;
		Студент = ДанныеЗаполнения.Студент;
	КонецЕсли;
	
КонецПроцедуры
