
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПросроченныеЗадолженности Расход
	Движения.ПросроченныеЗадолженности.Записывать = Истина;
	Для Каждого ТекСтрокаОтчисляемыеСтуденты Из ОтчисляемыеСтуденты Цикл
		Движение = Движения.ПросроченныеЗадолженности.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаОтчисляемыеСтуденты.Студент;
		Движение.Группа = ТекСтрокаОтчисляемыеСтуденты.Группа;
		Движение.Семестр = ТекСтрокаОтчисляемыеСтуденты.Семестр;
		Движение.КоличествоПросроченныхЗадолженностей = ТекСтрокаОтчисляемыеСтуденты.КоличествоПросроченныхЗадолженностей;
		Движение.СуммарноеВремяПросрочки = ТекСтрокаОтчисляемыеСтуденты.СуммарноеВремяПросрочки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
