
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ВедомостьОСистемеАкадемическихЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Дата,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Дисциплина,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.НаименованиеКонтроля,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Номер,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Оценка,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Преподаватель,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.СтатусАкадемическойЗадолженности,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Студент
	|ИЗ
	|	Документ.ВедомостьОСистемеАкадемическихЗадолженностей КАК ВедомостьОСистемеАкадемическихЗадолженностей
	|ГДЕ
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
