
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОценкиСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаРезультатЗаседанияКомиссии Из РезультатЗаседанияКомиссии Цикл
		Движение = Движения.ОценкиСтудентов.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаРезультатЗаседанияКомиссии.Студент;
		Движение.Группа = ТекСтрокаРезультатЗаседанияКомиссии.Группа;
		Движение.Дисциплина = ТекСтрокаРезультатЗаседанияКомиссии.Дисциплина;
		Движение.ВидКонтроля = ТекСтрокаРезультатЗаседанияКомиссии.ВидКонтроля;
		Движение.Преподаватель = Преподаватель;
		Движение.Оценка = ТекСтрокаРезультатЗаседанияКомиссии.Оценка;
	КонецЦикла;


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИндивидуальныйПланЛиквидацииЗадолженностей") Тогда
		
		Преподаватель = ДанныеЗаполнения.Преподаватель;
	КонецЕсли;
	
КонецПроцедуры
