&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИндивидуальныйПланЛиквидацииЗадолженностей") Тогда
		// Заполнение шапки
		Дисциплина = ДанныеЗаполнения.Дисциплина;
		НаименованиеКонтроля = ДанныеЗаполнения.НаименованиеКонтроля;
		Преподаватель = ДанныеЗаполнения.Преподаватель;
		Студент = ДанныеЗаполнения.Студент;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ТекущийСтатусЗадолженностей
	Движения.ТекущийСтатусЗадолженностей.Записывать = Истина;
	Движение = Движения.ТекущийСтатусЗадолженностей.Добавить();
	Движение.Студент = Студент;
	Движение.Дисциплина = Дисциплина;
	Движение.СтатусЗадолженности = СтатусАкадемическойЗадолженности;

	// регистр ОценкиСтудентов
	Движения.ОценкиСтудентов.Записывать = Истина;
	Движение = Движения.ОценкиСтудентов.Добавить();
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Дисциплина = Дисциплина;
	Движение.ВидКонтроля = НаименованиеКонтроля;
	Движение.Преподаватель = Преподаватель;
	Движение.Оценка = Оценка;

	
КонецПроцедуры

