

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НаправлениеНаПересдачу") Тогда
		// Заполнение шапки
		Дисциплина = ДанныеЗаполнения.Дисциплина;
		Преподаватель = ДанныеЗаполнения.Преподаватель;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Факультет = ДанныеЗаполнения.Факультет;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

