
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьУникальностьАудитории(Отказ, Объект.Наименование, Объект.Ссылка);

КонецПроцедуры


&НаСервере
Процедура ПроверитьУникальностьАудитории(Отказ, Наименование, Ссылка)

    Если Не ЗначениеЗаполнено(Наименование) Тогда
        Возврат;
    КонецЕсли;
    
    Отказ = Ложь;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
	"ВЫБРАТЬ
    |   Аудитории.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.Аудитории КАК Аудитории
    |ГДЕ
    |   Аудитории.Наименование = &Наименование
    |   И Аудитории.Ссылка <> &Ссылка";  
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    	
	РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такая аудитория уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

    
КонецПроцедуры
