
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьУникальностьПользователя(Отказ, Объект.Наименование, Объект.Ссылка);
КонецПроцедуры  

&НаСервере
Процедура ПроверитьУникальностьПользователя(Отказ, Наименование, Ссылка)

    Если Не ЗначениеЗаполнено(Наименование) Тогда
        Возврат;
    КонецЕсли;
    
    Отказ = Ложь;
    Запрос = Новый Запрос;
    Запрос.Текст =
	"ВЫБРАТЬ
    |   Пользователи.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.Пользователи КАК Пользователи
    |ГДЕ
    |   Пользователи.Наименование = &Наименование
    |   И Пользователи.Ссылка <> &Ссылка";  
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    	
	РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Данный пользователь уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

    
КонецПроцедуры

