
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности") Тогда
		
		Группа = ДанныеЗаполнения.Группа;
		Дисциплина = ДанныеЗаполнения.Дисциплина;
		ДатаПересдачи = ДанныеЗаполнения.ЗапрашиваемыйСрок;
		Причина = ДанныеЗаполнения.Ссылка;
		Студент = ДанныеЗаполнения.Студент;
		НаименованиеКонтроля = ДанныеЗаполнения.НаименованиеКонтроля;
	КонецЕсли;

КонецПроцедуры
