&НаСервере
Процедура ПроверитьУникальностьГруппы(Отказ, Наименование, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Группы.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.Группы КАК Группы
    |ГДЕ
    |   Группы.Наименование = &Наименование
    |   И Группы.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();


    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такая группа уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    

	ПроверитьУникальностьГруппы(Отказ, Объект.Наименование, Объект.Ссылка);
    
КонецПроцедуры