
&НаСервере
Функция НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение)
	Если Значение = Перечисления.КоличествоПропусков.Ноль Тогда
		Возврат "-";
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Один Тогда
		Возврат 2;
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Два Тогда
		Возврат 4;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзменении(Элемент)  
	ТЧ = Элементы.НазначениеСтудентаДляПреподавателя.ТекущиеДанные;
	Значение = ТЧ.КоличествоПропусков;
	ТЧ.ПотерянныеЧасыПреподавателя = НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	    ДисциплинаОснование = Объект.ДокументОснование.Дисциплина;
	ПреподавательОснование = Объект.ДокументОснование.Преподаватель;
	ФакультетОснование = Объект.ДокументОснование.Факультет;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаправлениеНаПересдачу.Студент КАК Студент
		|ИЗ
		|	Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу
		|ГДЕ
		|	НаправлениеНаПересдачу.Дисциплина = &ДисциплинаОснование
		|	И НаправлениеНаПересдачу.Преподаватель = &ПреподавательОснование
		|	И НаправлениеНаПересдачу.Факультет = &ФакультетОснование";
	
	Запрос.УстановитьПараметр("ДисциплинаОснование", ДисциплинаОснование);
	Запрос.УстановитьПараметр("ПреподавательОснование", ПреподавательОснование);
	Запрос.УстановитьПараметр("ФакультетОснование", ФакультетОснование);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТаблицаСтудентов = РезультатЗапроса.Выгрузить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтр = Объект.НазначениеСтудентаДляПреподавателя.Добавить();
		НоваяСтр.Студент = ВыборкаДетальныеЗаписи.Студент;  
		
	КонецЦикла;

КонецПроцедуры
