
&НаСервере
Функция НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение)
	Если Значение = Перечисления.КоличествоПропусков.Ноль Тогда
		Возврат "-";
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Один Тогда
		Возврат 2;
	ИначеЕсли Значение = Перечисления.КоличествоПропусков.Два Тогда
		Возврат 4;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзменении(Элемент)  
	ТЧ = Элементы.НазначениеСтудентаДляПреподавателя.ТекущиеДанные;
	Значение = ТЧ.КоличествоПропусков;
	ТЧ.ПотерянныеЧасыПреподавателя = НазначениеСтудентаДляПреподавателяКоличествоПропусковПриИзмененииНаСервере(Значение);
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда) 
		
	Команда1НаСервере();
КонецПроцедуры


&НаСервере
Процедура Команда1НаСервере()    
	
		
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	НаправлениеНаПересдачу.Студент КАК Студент
	//	|ИЗ
	//	|	Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу
	//	|ГДЕ
	//	|	НаправлениеНаПересдачу.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);	
	//РезультатЗапроса = Запрос.Выполнить();	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	//ВыборкаДетальныеЗаписи.Следующий();
	//
	//Студент = ВыборкаДетальныеЗаписи.Студент;
	//
	//НоваяСтр = Объект.НазначениеСтудентаДляПреподавателя.Добавить();
	//НоваяСтр.Студент = Студент;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	НаправлениеНаПересдачу.Студент КАК Студент
	//	|ИЗ
	//	|	Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	НовСтр = Объект..Добавить();
	//	ЗаполнитьЗначенияСвойств (НовСтр, ВыборкаДетальныеЗаписи);
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	    ДисциплинаОснование = Объект.ДокументОснование.Дисциплина;
	ПреподавательОснование = Объект.ДокументОснование.Преподаватель;
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаправлениеНаПересдачу.Студент КАК Студент
		|ИЗ
		|	Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу
		|ГДЕ
		|	НаправлениеНаПересдачу.Дисциплина = &ДисциплинаОснование
		|	И НаправлениеНаПересдачу.Преподаватель = &ПреподавательОснование";
	
	Запрос.УстановитьПараметр("ДисциплинаОснование", ДисциплинаОснование);
	Запрос.УстановитьПараметр("ПреподавательОснование", ПреподавательОснование);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТаблицаСтудентов = РезультатЗапроса.Выгрузить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтр = Объект.НазначениеСтудентаДляПреподавателя.Добавить();
		НоваяСтр.Студент = ВыборкаДетальныеЗаписи.Студент;
	КонецЦикла;

КонецПроцедуры
