
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Группа,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Дата,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Дисциплина,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.ЗапрашиваемыйСрок,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Номер,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.ПричинаПродления,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.СтатусРассмотрения,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Студент,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.НаименованиеКонтроля
	|ИЗ
	|	Документ.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности КАК ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности
	|ГДЕ
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
