
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетСтипендииСУчетомЗадолженностей
	Движения.РасчетСтипендииСУчетомЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаРезультатЗаседанияКомиссии Из РезультатЗаседанияКомиссии Цикл
		Движение = Движения.РасчетСтипендииСУчетомЗадолженностей.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = Дата;
		Движение.Студент = ТекСтрокаРезультатЗаседанияКомиссии.Студент;
		Движение.БазоваяСтипендия = ТекСтрокаРезультатЗаседанияКомиссии.БазоваяСтипендия;
		Движение.ПричинаИзменения = ТекСтрокаРезультатЗаседанияКомиссии.ПричинаИзменения;
	КонецЦикла;

	// регистр ТекущийСтатусЗадолженностей
	Движения.ТекущийСтатусЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаРезультатЗаседанияКомиссии Из РезультатЗаседанияКомиссии Цикл
		Движение = Движения.ТекущийСтатусЗадолженностей.Добавить();
		Движение.Студент = ТекСтрокаРезультатЗаседанияКомиссии.Студент;
		Движение.Дисциплина = ТекСтрокаРезультатЗаседанияКомиссии.Дисциплина;
		Движение.СтатусЗадолженности = ТекСтрокаРезультатЗаседанияКомиссии.Оценка;
	КонецЦикла;

	// регистр УспешныеПересдачи Приход
	Движения.УспешныеПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаРезультатЗаседанияКомиссии Из РезультатЗаседанияКомиссии Цикл
		Движение = Движения.УспешныеПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаРезультатЗаседанияКомиссии.Студент;
		Движение.Дисциплина = ТекСтрокаРезультатЗаседанияКомиссии.Дисциплина;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ПланВидовРасчетаСсылка.ПланВидовРасчета") Тогда
		// Заполнение шапки
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьУчетаЗадолженностей") Тогда
		// Заполнение шапки
		Для Каждого ТекСтрокаДолги Из ДанныеЗаполнения.Долги Цикл
			НоваяСтрока = РезультатЗаседанияКомиссии.Добавить();
			НоваяСтрока.Студент = ТекСтрокаДолги.Студент;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьУчетаЗадолженностейДляСтудентовСИОМ") Тогда
		// Заполнение шапки
		Для Каждого ТекСтрокаДолги Из ДанныеЗаполнения.Долги Цикл
			НоваяСтрока = РезультатЗаседанияКомиссии.Добавить();
			НоваяСтрока.Студент = ТекСтрокаДолги.Студент;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
