
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДинамикаЛиквидацииЗадолженностей 
	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаДолги.Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.КоличествоЛиквидированныхЗадолженностей = ТекСтрокаДолги.НомерСтроки;
	КонецЦикла;

	// регистр УспешныеПересдачи Приход
	Движения.УспешныеПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.УспешныеПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаДолги.Студент;
		Движение.Группа = Группа;
		Движение.Дисциплина = ТекСтрокаДолги.Дисциплина;
		Движение.КоличествоУспешныхПересдач = ТекСтрокаДолги.НомерСтроки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
