
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОценкиСтудентов
	Движения.ОценкиСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаРезультатЗаседанияКомиссии Из РезультатЗаседанияКомиссии Цикл
		Движение = Движения.ОценкиСтудентов.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаРезультатЗаседанияКомиссии.Студент;
		Движение.Группа = ТекСтрокаРезультатЗаседанияКомиссии.Группа;
		Движение.УчебныйПериод = ТекСтрокаРезультатЗаседанияКомиссии.УчебныеГода;
		Движение.Дисциплина = ТекСтрокаРезультатЗаседанияКомиссии.Дисциплина;
		Движение.ВидКонтроля = ТекСтрокаРезультатЗаседанияКомиссии.ВидКонтроля;
		Движение.Преподаватель = Председатель;
		Движение.Оценка = ТекСтрокаРезультатЗаседанияКомиссии.Оценка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ПланВидовРасчетаСсылка.ПланВидовРасчета") Тогда
		// Заполнение шапки
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьУчетаЗадолженностей") Тогда
		// Заполнение шапки
		Для Каждого ТекСтрокаДолги Из ДанныеЗаполнения.Долги Цикл
			НоваяСтрока = РезультатЗаседанияКомиссии.Добавить();
			НоваяСтрока.Студент = ТекСтрокаДолги.Студент;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьУчетаЗадолженностейДляСтудентовСИОМ") Тогда
		// Заполнение шапки
		Для Каждого ТекСтрокаДолги Из ДанныеЗаполнения.Долги Цикл
			НоваяСтрока = РезультатЗаседанияКомиссии.Добавить();
			НоваяСтрока.Студент = ТекСтрокаДолги.Студент;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
