
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.НаправлениеНаПересдачу.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаправлениеНаПересдачу.Аудитория,
	|	НаправлениеНаПересдачу.Группа,
	|	НаправлениеНаПересдачу.Дата,
	|	НаправлениеНаПересдачу.ДатаПроведения,
	|	НаправлениеНаПересдачу.Дисциплина,
	|	НаправлениеНаПересдачу.Курс,
	|	НаправлениеНаПересдачу.ЛичныйИндекс,
	|	НаправлениеНаПересдачу.НаправленияПодготовки,
	|	НаправлениеНаПересдачу.Номер,
	|	НаправлениеНаПересдачу.Преподаватель,
	|	НаправлениеНаПересдачу.Студент,
	|	НаправлениеНаПересдачу.Факультет,
	|	НаправлениеНаПересдачу.НаименованиеКонтроля,
	|	НаправлениеНаПересдачу.ФормаОбучения
	|ИЗ
	|	Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу
	|ГДЕ
	|	НаправлениеНаПересдачу.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
