
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ПриказОбОтчислении.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриказОбОтчислении.Дата,
	|	ПриказОбОтчислении.ДатаОтчисления,
	|	ПриказОбОтчислении.Номер,
	|	ПриказОбОтчислении.Основание,
	|	ПриказОбОтчислении.ОтчисляемыеСтуденты.(
	|		НомерСтроки,
	|		Студент,
	|		Группа,
	|		Семестр,
	|		НаправленияПодготовки,
	|		КоличествоПросроченныхЗадолженностей,
	|		СуммарноеВремяПросрочки,
	|		ПериодЗадолженностейС,
	|		ПериодЗадолженностейПо
	|	)
	|ИЗ
	|	Документ.ПриказОбОтчислении КАК ПриказОбОтчислении
	|ГДЕ
	|	ПриказОбОтчислении.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОтчисляемыеСтудентыШапка = Макет.ПолучитьОбласть("ОтчисляемыеСтудентыШапка");
	ОбластьОтчисляемыеСтуденты = Макет.ПолучитьОбласть("ОтчисляемыеСтуденты");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОтчисляемыеСтудентыШапка);
		ВыборкаОтчисляемыеСтуденты = Выборка.ОтчисляемыеСтуденты.Выбрать();
		Пока ВыборкаОтчисляемыеСтуденты.Следующий() Цикл
			ОбластьОтчисляемыеСтуденты.Параметры.Заполнить(ВыборкаОтчисляемыеСтуденты);
			ТабДок.Вывести(ОбластьОтчисляемыеСтуденты, ВыборкаОтчисляемыеСтуденты.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
