
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриказОбОтчислении.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриказОбОтчислении.Группа,
	|	ПриказОбОтчислении.Дата,
	|	ПриказОбОтчислении.КоличествоПросроченныхЗадолженностей,
	|	ПриказОбОтчислении.НаправленияПодготовки,
	|	ПриказОбОтчислении.Номер,
	|	ПриказОбОтчислении.Основание,
	|	ПриказОбОтчислении.Семестр,
	|	ПриказОбОтчислении.Студент,
	|	ПриказОбОтчислении.СуммарноеВремяПросрочки
	|ИЗ
	|	Документ.ПриказОбОтчислении КАК ПриказОбОтчислении
	|ГДЕ
	|	ПриказОбОтчислении.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
