
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ПросроченныеЗадолженности.Записывать = Истина;
	Для Каждого ТекСтрокаОтчисляемыеСтуденты Из ОтчисляемыеСтуденты Цикл
		Движение = Движения.ПросроченныеЗадолженности.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаОтчисляемыеСтуденты.Студент;
		Движение.Группа = ТекСтрокаОтчисляемыеСтуденты.Группа;
		Движение.Семестр = ТекСтрокаОтчисляемыеСтуденты.Семестр;
		Движение.КоличествоПросроченныхЗадолженностей = ТекСтрокаОтчисляемыеСтуденты.КоличествоПросроченныхЗадолженностей;
	КонецЦикла;


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколЗаседанияКомиссии") Тогда
		
		Основание = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры
