&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
  Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
        ЛичныйИндексСотрудника = ПолучитьЛичныйИндексСотрудникаНаСервере(Объект.Сотрудник);
        Объект.ЛичныйИндексСотрудника = ЛичныйИндексСотрудника;
    Иначе
        Объект.ЛичныйИндексСотрудника = Неопределено;
    КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьЛичныйИндексСотрудникаНаСервере(СсылкаНаСотрудника)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Сотрудники.IDСотрудника КАК IDСотрудника
    |ИЗ
    |	Справочник.Сотрудники КАК Сотрудники
    |ГДЕ
    |	Сотрудники.Ссылка = &СсылкаНаСотрудника";
    
    Запрос.УстановитьПараметр("СсылкаНаСотрудника", СсылкаНаСотрудника);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.IDСотрудника;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции



