&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
  Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НаправлениеНаПересдачу") Тогда

	  ЭтотОбъект.Дисциплина = ДанныеЗаполнения.Дисциплина;
    ЭтотОбъект.Преподаватель = ДанныеЗаполнения.Преподаватель;
    ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
    ЭтотОбъект.Студент = ДанныеЗаполнения.Студент;
    ЭтотОбъект.Факультет = ДанныеЗаполнения.Факультет;

	Если ЗначениеЗаполнено(ДанныеЗаполнения.Студент) Тогда
      Запрос = Новый Запрос;
      Запрос.Текст = 
      "ВЫБРАТЬ
      |  Студенты.Семестр КАК Семестр
      |ИЗ
      |  Справочник.Студенты КАК Студенты
      |ГДЕ
      |  Студенты.Ссылка = &СсылкаНаСтудента";
      
      Запрос.УстановитьПараметр("СсылкаНаСтудента", ДанныеЗаполнения.Студент);
      Результат = Запрос.Выполнить();
      Выборка = Результат.Выбрать();
      
      Если Выборка.Следующий() Тогда
        ЭтотОбъект.Семестр = Выборка.Семестр;
      КонецЕсли;
    КонецЕсли;
  КонецЕсли;
КонецПроцедуры