&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
    Если ЗначениеЗаполнено(Объект.Студент) Тогда
        СеместрСтудента = ПолучитьСеместрСтудентаНаСервере(Объект.Студент);
        Объект.Семестр = СеместрСтудента;
    Иначе
        Объект.Факультет = Неопределено;
    КонецЕсли;
КонецПроцедуры        

&НаСервере
Функция ПолучитьСеместрСтудентаНаСервере(СсылкаНаСтудента)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Студенты.Семестр КАК Семестр
    |ИЗ
    |	Справочник.Студенты КАК Студенты
    |ГДЕ
    |	Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Семестр;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьУникальностьСтудента(Отказ, Объект.Студент, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьСтудента(Отказ, Студент, Ссылка)

    Если Не ЗначениеЗаполнено(Студент) Тогда
        Возврат;
    КонецЕсли;
    
    Отказ = Ложь;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
	"ВЫБРАТЬ
    |   СеместрыСтудентов.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.СеместрыСтудентов КАК СеместрыСтудентов
    |ГДЕ
    |   СеместрыСтудентов.Студент = &Студент
    |   И СеместрыСтудентов.Ссылка <> &Ссылка";  
	
	Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    	
	РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Выбранный студент уже записан!");
        Отказ = Истина;
    КонецЕсли;

    
КонецПроцедуры

