
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПостроитьФормуОбученияНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьФормуОбученияНаСервере()
	Круговая.Очистить();
	Круговая.АвтоТранспонирование = Ложь;
	Круговая.Обновление = Ложь;
	
	Очников = ПолучитьКоличествоПоФормеОбучения(Перечисления.ФормаОбучения.Очная);
	Заочников = ПолучитьКоличествоПоФормеОбучения(Перечисления.ФормаОбучения.Заочная);
	ОчноЗаочников = ПолучитьКоличествоПоФормеОбучения(Перечисления.ФормаОбучения.ОчноЗаочная);
	
	Точка = Круговая.УстановитьТочку("Количество студентов");
	
	Серия1 = Круговая.Серии.Добавить("Очников ");	
	Круговая.УстановитьЗначение(Точка, Серия1, Очников, "Очников", Строка(Очников) + " очников");
	
	Серия2 = Круговая.Серии.Добавить("Заочников");	
	Круговая.УстановитьЗначение(Точка, Серия2, Заочников, "Заочников", Строка(Заочников) + " заочников");
	
	Серия3 = Круговая.Серии.Добавить("Очно-заочников");	
	Круговая.УстановитьЗначение(Точка, Серия3, ОчноЗаочников, "Очно-заочников", Строка(ОчноЗаочников) + " очно-заочников");
КонецПроцедуры 

&НаСервере
Функция ПолучитьКоличествоПоФормеОбучения(ФормаОбучения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	Студенты.ФормаОбучения = &ФормаОбучения";
	
	Запрос.УстановитьПараметр("ФормаОбучения", ФормаОбучения);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	КоличествоСтудентов = РезультатЗапроса.Количество;
	Возврат КоличествоСтудентов;
КонецФункции


&НаКлиенте
Процедура Возвращение(Команда)
	
	    Форма = ПолучитьФорму("Обработка.БизнесАналитика.Форма.ФункционалПервый");
	    // Делаем открытие данной формы
	    Форма.Открыть();	
	
КонецПроцедуры

