
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Дата,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Дисциплина,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.ДокументОснование,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Номер,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Преподаватель,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.РольВКомиссии,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Семестр,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Студент,
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Факультет
	|ИЗ
	|	Документ.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей КАК ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей
	|ГДЕ
	|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
