
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ИндивидуальныйПланЛиквидацииЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Аудитория,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Время,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Группа,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Дата,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.ДатаПересдачи,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Дисциплина,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Номер,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Преподаватель,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Причина,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Студент,
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.ФормаКонтроля
	|ИЗ
	|	Документ.ИндивидуальныйПланЛиквидацииЗадолженностей КАК ИндивидуальныйПланЛиквидацииЗадолженностей
	|ГДЕ
	|	ИндивидуальныйПланЛиквидацииЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
