
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности") Тогда
                
        // Заполнение реквизитов документа
        Группа = ДанныеЗаполнения.Группа;
        Дисциплина = ДанныеЗаполнения.Дисциплина;
        ДатаПересдачи = ДанныеЗаполнения.ЗапрашиваемыйСрок;
        ФормаКонтроля = ДанныеЗаполнения.ФормаКонтроля;
        Причина = ДанныеЗаполнения.Ссылка;
        Студент = ДанныеЗаполнения.Студент;
		
		// Проверка уникальности ИОМ
		
		ПроверитьУникальностьИОМ(ДанныеЗаполнения.Студент, ДанныеЗаполнения.Дисциплина, "", ДанныеЗаполнения.Ссылка);
	
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьИОМ(Студент, Дисциплина, ИмяСтудента = "", ДокументОснование)
    
    // Получаем имя студента, если передан студент
    Если ЗначениеЗаполнено(Студент) Тогда
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    Студенты.Наименование КАК Наименование
        |ИЗ
        |    Справочник.Студенты КАК Студенты
        |ГДЕ
        |    Студенты.Ссылка = &СсылкаНаСтудента";
        
        Запрос.УстановитьПараметр("СсылкаНаСтудента", Студент);
        Результат = Запрос.Выполнить();
        Выборка = Результат.Выбрать();
        
        Если Выборка.Следующий() Тогда
            ИмяСтудента = Выборка.Наименование;
        КонецЕсли;
	КонецЕсли;
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Ссылка КАК Ссылка,
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Дата КАК Дата,
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Номер КАК Номер,
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Причина КАК Причина
    |ИЗ
    |    Документ.ИндивидуальныйПланЛиквидацииЗадолженностей КАК ИндивидуальныйПланЛиквидацииЗадолженностей
    |ГДЕ
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Студент = &Студент
    |    И ИндивидуальныйПланЛиквидацииЗадолженностей.Дисциплина = &Дисциплина
    |    И ИндивидуальныйПланЛиквидацииЗадолженностей.ПометкаУдаления = ЛОЖЬ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Дисциплина", Дисциплина);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

   Если Выборка.Количество() > 0 Тогда
            ВызватьИсключение ("Для студента «" + Студент +"» уже существует документ «Индивидуальный план ликвидации задолженностей» по дисциплине «"+Дисциплина+ "»!");
        КонецЕсли;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДатыПересдач
	Движения.ДатыПересдач.Записывать = Истина;
	Движение = Движения.ДатыПересдач.Добавить();
	Движение.Преподаватель = Преподаватель;
	Движение.Аудитория = Аудитория;
	Движение.Дисциплина = Дисциплина;
	Движение.ДатаВыдачи = ДатаПересдачи;
	Движение.ДатаПересдачи = ДатаПересдачи;
	Движение.ВремяПересдачи = Время;

КонецПроцедуры
