
&НаКлиенте
Процедура ПриложенныеДокументыПриИзменении(Элемент)
	Если Объект.ПриложенныеДокументы = Истина Тогда
		Элементы.Подтверждение.Видимость = Истина;
		
	Иначе
		Элементы.Подтверждение.Видимость = Ложь;    
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПутьКФайлу(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    Если ЭтотОбъект.Подтверждение Тогда // Используем реквизит напрямую
        ВыбратьФайл("Выбор файла для подтверждения", Новый ОписаниеОповещения("ПослеВыбораФайлаДляПодтверждения", ЭтотОбъект));
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл(ЗаголовокДиалога, Оповещение)  
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборФайла);
    Диалог.Заголовок = ЗаголовокДиалога;
    Диалог.Показать(Оповещение);  
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаДляПодтверждения(ВыбранныеФайлы, Параметры) Экспорт
    Если ВыбранныеФайлы = Неопределено Или ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    ПутьКФайлу = ВыбранныеФайлы[0];
    // Обновление реквизита "Подтверждение" значением выбранного файла
    ЭтотОбъект.Подтверждение = ПутьКФайлу;  // Записываем путь к файлу в реквизит
КонецПроцедуры   

&НаКлиенте
Процедура ПодтверждениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ЗапуститьПриложение(Объект.Подтверждение);
КонецПроцедуры



