
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьУникальностьПрофиляПодготовкиСтудента(Отказ, Объект.Наименование, Объект.Ссылка);
КонецПроцедуры 

&НаСервере
Процедура ПроверитьУникальностьПрофиляПодготовкиСтудента(Отказ, Наименование, Ссылка)

    Если Не ЗначениеЗаполнено(Наименование) Тогда
        Возврат;
    КонецЕсли;
    
    Отказ = Ложь;
    Запрос = Новый Запрос;
    Запрос.Текст =
	"ВЫБРАТЬ
    |   ПрофилиПодготовкиСтудентов.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.ПрофилиПодготовкиСтудентов КАК ПрофилиПодготовкиСтудентов
    |ГДЕ
    |   ПрофилиПодготовкиСтудентов.Наименование = &Наименование
    |   И ПрофилиПодготовкиСтудентов.Ссылка <> &Ссылка";  
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    	
	РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой профиль подготовки студента уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;

    
КонецПроцедуры

