
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетНагрузкиПреподавателейПоПересдачам
	Движения.РасчетНагрузкиПреподавателейПоПересдачам.Записывать = Истина;
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.РасчетНагрузкиПреподавателейПоПересдачам.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = ТекСтрокаПлан.КрайнийСрок;
		Движение.Преподаватель = ТекСтрокаПлан.Преподаватель;
		Движение.Период = Дата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности") Тогда
		// Заполнение шапки
		Студент = ДанныеЗаполнения.Студент;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
