
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетНагрузкиПреподавателейПоПересдачам
	Движения.РасчетНагрузкиПреподавателейПоПересдачам.Записывать = Истина;
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.РасчетНагрузкиПреподавателейПоПересдачам.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = ДатаСоставления;
		Движение.Преподаватель = ТекСтрокаПлан.Преподаватель;
		Движение.Период = ДатаСоставления;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
