
&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Студент) Тогда
        ЛичныйИндексСтудента = ПолучитьЛичныйИндексСтудентаНаСервере(Объект.Студент);
        Объект.ЛичныйИндексСтудента = ЛичныйИндексСтудента;
    Иначе
        Объект.ПолучитьЛичныйИндексСтудентаНаСервере = Неопределено;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЛичныйИндексСтудентаНаСервере(СсылкаНаСтудента)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Студенты.ЛичныйИндекс КАК ЛичныйИндекс
    |ИЗ
    |	Справочник.Студенты КАК Студенты
    |ГДЕ
    |	Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.ЛичныйИндекс;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции



